PBL5/3_Instagram_Feed/load-test-baseline-100.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalCount: 10   # Run the scenario only once

scenarios:
  - name: "Create Post - User with 100 Followers"
    flow:
      - post:
          url: "/api/posts"
          json:
            user_id: 12 # user12 is celebrity with 100 followers
            caption: "Hariii- {{ $randomString() }}"
            image_url: "https://example.com/image-{{ $randomNumber(1, 1000) }}.jpg"