PBL5/3_Instagram_Feed/load-test-baseline-500Req200 copy.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 200 # Run the scenario only once

scenarios:
  - name: "Create Post - User with 500 Followers"
    flow:
      - post:
          url: "/api/posts"
          json:
            user_id: 1 # user12 is celebrity with 500 followers
            caption: "Load Test for 500 requests- {{ $randomString() }}"
            image_url: "https://example.com/image-{{ $randomNumber(1, 1000) }}.jpg"